<a href="https://colab.research.google.com/github/Muvazana/Artificial-Intelligence---KNN/blob/main/AI_Group_2_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Tugas Program KNN Kelompok-2**
Anggota:
- AZRIEL FARASFAUZAN SEPVIRA (1301190359)
- MOCH. NAUVAL RIZALDI NASRIL (1301194482)

# Import Library

In [ ]:
import numpy as np
import pandas as pd
from math import sqrt

# Membaca file training data dan Prapemrosesan data


---

## Membaca File mobil.xls

In [ ]:
raw_data = pd.read_excel("https://github.com/Muvazana/Artificial-Intelligence---KNN/blob/main/mobil.xls?raw=true")
raw_data.head()

       Nama Mobil  Ukuran  Kenyamanan  Irit  Kecepatan  Harga (Ratus Juta)
0     Toyota Agya       4           4     9          6                1.00
1   Daihatsu Alya       4           3     9          6                1.10
2   Toyota Avanza       6           5     6          6                2.00
3  Daihatsu Xenia       6           4     6          6                1.75
4         Xpander       7           7     6          7                2.25

## Membaca File test.xls

In [ ]:
test_data = pd.read_excel("https://github.com/Muvazana/Artificial-Intelligence---KNN/blob/main/test.xls?raw=true")
test_data.head()

   Ukuran  Kenyamanan  Irit  Kecepatan  Harga (Ratus Juta)
0       5           7     8          8                 2.5

## Prapemrosesan data dari mobil.xls

In [ ]:
raw_data.isna().sum() # menghilangkan data yang null
data = raw_data.drop(["Nama Mobil"], axis = 1) # menghilangkan column yang tidak dipakai
display(data.head())

   Ukuran  Kenyamanan  Irit  Kecepatan  Harga (Ratus Juta)
0       4           4     9          6                1.00
1       4           3     9          6                1.10
2       6           5     6          6                2.00
3       6           4     6          6                1.75
4       7           7     6          7                2.25

# Perhitungan ukuran jarak

In [ ]:
def euclideanDistanceMethod(data1, data2):
  return sqrt(sum([(data1[i] - data2[i]) ** 2 for i in range(len(data1))]))

def manhattanDistanceMethod(data1, data2):
  return sum([abs(data1[i] - data2[i]) for i in range(len(data1))])

def minkowskiDistanceMethod(data1, data2, p):
  return sum([abs(data1[i] - data2[i]) ** p for i in range(len(data1))]) ** (1/p)

def supremumDistanceMethod(data1, data2):
  return max([abs(data1[i] - data2[i]) for i in range(len(data1))])

# Pemprosessan KNN

In [ ]:
def knnMethod(k):
  euclidean_distance_list = []
  manhattan_distance_list = []
  minkowski_distance_list = []
  supremum_distance_list = []
  
  for item in data.values:
    euclidean_distance_list.append(euclideanDistanceMethod(item, test_data.values[0]))
    manhattan_distance_list.append(manhattanDistanceMethod(item, test_data.values[0]))
    minkowski_distance_list.append(minkowskiDistanceMethod(item, test_data.values[0], 3))
    supremum_distance_list.append(supremumDistanceMethod(item, test_data.values[0]))

  raw_data["Euclidean Distance"] = euclidean_distance_list
  raw_data["Manhattan Distance"] = manhattan_distance_list
  raw_data["Minkowski Distance"] = minkowski_distance_list
  raw_data["Supremum Distance"]  = supremum_distance_list

  euclidean_sorted = raw_data.sort_values(by=['Euclidean Distance'])[:k]
  manhattan_sorted = raw_data.sort_values(by=['Manhattan Distance'])[:k]
  minkowski_sorted = raw_data.sort_values(by=['Minkowski Distance'])[:k]
  supremum_sorted = raw_data.sort_values(by=['Supremum Distance'])[:k]

  all_rekomendasi = pd.DataFrame()
  all_rekomendasi["Euclidean Distance"] = euclidean_sorted["Nama Mobil"]
  all_rekomendasi["Manhattan Distance"] = euclidean_sorted["Nama Mobil"]
  all_rekomendasi["Minkowski Distance"] = euclidean_sorted["Nama Mobil"]
  all_rekomendasi["Supremum Distance"] = euclidean_sorted["Nama Mobil"]

  all_rekomendasi.to_excel('Rekomendasi.xls', index=False, header=True)

  euclidean_sorted["Nama Mobil"].to_excel('Rekomendasi Euclidean Distance.xls', index=False, header=False)
  manhattan_sorted["Nama Mobil"].to_excel('Rekomendasi Manhattan Distance.xls', index=False, header=False)
  minkowski_sorted["Nama Mobil"].to_excel('Rekomendasi Minkowski Distance.xls', index=False, header=False)
  supremum_sorted["Nama Mobil"].to_excel('Rekomendasi Supremum Distance.xls', index=False, header=False)

  return euclidean_sorted, manhattan_sorted, minkowski_sorted, supremum_sorted

euclidean, manhattan, minkowski, supremum = knnMethod(3)

print("---> Testing Input :")
display(test_data)
print("---> Sort By: Euclidean Distance:")
display(euclidean)
print("---> Sort By: Manhattan Distance:")
display(manhattan)
print("---> Sort By: Minkowski Distance:")
display(minkowski)
print("---> Sort By: Supremum Distance:")
display(supremum)

---> Testing Input :

   Ukuran  Kenyamanan  Irit  Kecepatan  Harga (Ratus Juta)
0       5           7     8          8                 2.5

---> Sort By: Euclidean Distance:

       Nama Mobil  Ukuran  ...  Minkowski Distance  Supremum Distance
9     Toyota Vios       5  ...            1.000000                1.0
10     Honda City       5  ...            1.261599                1.0
15  Suzuki Ertiga       7  ...            2.155009                2.0

[3 rows x 10 columns]

---> Sort By: Manhattan Distance:

       Nama Mobil  Ukuran  ...  Minkowski Distance  Supremum Distance
9     Toyota Vios       5  ...            1.000000                1.0
10     Honda City       5  ...            1.261599                1.0
15  Suzuki Ertiga       7  ...            2.155009                2.0

[3 rows x 10 columns]

---> Sort By: Minkowski Distance:

       Nama Mobil  Ukuran  ...  Minkowski Distance  Supremum Distance
9     Toyota Vios       5  ...            1.000000                1.0
10     Honda City       5  ...            1.261599                1.0
15  Suzuki Ertiga       7  ...            2.155009                2.0

[3 rows x 10 columns]

---> Sort By: Supremum Distance:

       Nama Mobil  Ukuran  ...  Minkowski Distance  Supremum Distance
9     Toyota Vios       5  ...            1.000000                1.0
10     Honda City       5  ...            1.261599                1.0
2   Toyota Avanza       6  ...            2.928883                2.0

[3 rows x 10 columns]